zephyrproject-rtos/hal_microchip/pic32c/pic32cx_sg/pic32cx_sg41/atdf/PIC32CX1025SG41064.atdf
        <module name="DMAC" id="U2503" version="1.0.1">
          <instance name="DMAC">
            <register-group name="DMAC" name-in-module="DMAC" address-space="base" offset="0x4100A000"/>
            <parameters>
              <param name="BURST" value="1" caption="0: no burst support; 1: burst support"/>
              <param name="CH_BITS" value="5" caption="Number of bits to select channel"/>
              <param name="CH_NUM" value="32" caption="Number of channels"/>
              <param name="EVIN_NUM" value="8" caption="Number of input events"/>
              <param name="EVOUT_NUM" value="4" caption="Number of output events"/>
              <param name="FIFO_SIZE" value="16" caption="FIFO size for burst mode."/>
              <param name="LVL_BITS" value="2" caption="Number of bits to select level priority"/>
              <param name="LVL_NUM" value="4" caption="Enable priority level number"/>
              <param name="QOSCTRL_D_RESETVALUE" value="2" caption="QOS dmac ahb interface reset value"/>
              <param name="QOSCTRL_F_RESETVALUE" value="2" caption="QOS dmac fetch interface reset value"/>
              <param name="QOSCTRL_WRB_RESETVALUE" value="2" caption="QOS dmac write back interface reset value"/>
              <param name="TRIG_BITS" value="7" caption="Number of bits to select trigger source"/>
              <param name="TRIG_NUM" value="85" caption="Number of peripheral triggers"/>
              <param name="CHANNEL0_INT_SRC" value="31" caption="DMA Channel 0 Interrupt"/>
              <param name="CHANNEL1_INT_SRC" value="32" caption="DMA Channel 1 Interrupt"/>
              <param name="CHANNEL2_INT_SRC" value="33" caption="DMA Channel 2 Interrupt"/>
              <param name="CHANNEL3_INT_SRC" value="34" caption="DMA Channel 3 Interrupt"/>
              <param name="CHANNEL4_INT_SRC" value="35" caption="DMA Channel 4 Interrupt"/>
              <param name="CHANNEL5_INT_SRC" value="35" caption="DMA Channel 5 Interrupt"/>
              <param name="CHANNEL6_INT_SRC" value="35" caption="DMA Channel 6 Interrupt"/>
              <param name="CHANNEL7_INT_SRC" value="35" caption="DMA Channel 7 Interrupt"/>
              <param name="CHANNEL8_INT_SRC" value="35" caption="DMA Channel 8 Interrupt"/>
              <param name="CHANNEL9_INT_SRC" value="35" caption="DMA Channel 9 Interrupt"/>
              <param name="CHANNEL10_INT_SRC" value="35" caption="DMA Channel 10 Interrupt"/>
              <param name="CHANNEL11_INT_SRC" value="35" caption="DMA Channel 11 Interrupt"/>
              <param name="CHANNEL12_INT_SRC" value="35" caption="DMA Channel 12 Interrupt"/>
              <param name="CHANNEL13_INT_SRC" value="35" caption="DMA Channel 13 Interrupt"/>
              <param name="CHANNEL14_INT_SRC" value="35" caption="DMA Channel 14 Interrupt"/>
              <param name="CHANNEL15_INT_SRC" value="35" caption="DMA Channel 15 Interrupt"/>
              <param name="CHANNEL16_INT_SRC" value="35" caption="DMA Channel 16 Interrupt"/>
              <param name="CHANNEL17_INT_SRC" value="35" caption="DMA Channel 17 Interrupt"/>
              <param name="CHANNEL18_INT_SRC" value="35" caption="DMA Channel 18 Interrupt"/>
              <param name="CHANNEL19_INT_SRC" value="35" caption="DMA Channel 19 Interrupt"/>
              <param name="CHANNEL20_INT_SRC" value="35" caption="DMA Channel 20 Interrupt"/>
              <param name="CHANNEL21_INT_SRC" value="35" caption="DMA Channel 21 Interrupt"/>
              <param name="CHANNEL22_INT_SRC" value="35" caption="DMA Channel 22 Interrupt"/>
              <param name="CHANNEL23_INT_SRC" value="35" caption="DMA Channel 23 Interrupt"/>
              <param name="CHANNEL24_INT_SRC" value="35" caption="DMA Channel 24 Interrupt"/>
              <param name="CHANNEL25_INT_SRC" value="35" caption="DMA Channel 25 Interrupt"/>
              <param name="CHANNEL26_INT_SRC" value="35" caption="DMA Channel 26 Interrupt"/>
              <param name="CHANNEL27_INT_SRC" value="35" caption="DMA Channel 27 Interrupt"/>
              <param name="CHANNEL28_INT_SRC" value="35" caption="DMA Channel 28 Interrupt"/>
              <param name="CHANNEL29_INT_SRC" value="35" caption="DMA Channel 29 Interrupt"/>
              <param name="CHANNEL30_INT_SRC" value="35" caption="DMA Channel 30 Interrupt"/>
              <param name="CHANNEL31_INT_SRC" value="35" caption="DMA Channel 31 Interrupt"/>
              <param name="INSTANCE_ID" value="37" caption="Instance index for DMAC"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="U2410" version="1.0.0">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x41002000"/>
            <parameters>
              <param name="DMAC_ID_DCC0" value="2" caption="DMAC ID for DCC0 register"/>
              <param name="DMAC_ID_DCC1" value="3" caption="DMAC ID for DCC1 register"/>
              <param name="INSTANCE_ID" value="33" caption="Instance index for DSU"/>
            </parameters>
          </instance>
        </module>
        <module name="EIC" id="U2254" version="3.0.0">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x40002800"/>
            <signals>
              <signal group="EXTINT" index="0" function="A" pad="PA00"/>
              <signal group="EXTINT" index="0" function="A" pad="PA16"/>
              <signal group="EXTINT" index="0" function="A" pad="PB00"/>
              <signal group="EXTINT" index="0" function="A" pad="PB16"/>
              <signal group="EXTINT" index="1" function="A" pad="PA01"/>
              <signal group="EXTINT" index="1" function="A" pad="PA17"/>
              <signal group="EXTINT" index="1" function="A" pad="PB01"/>
              <signal group="EXTINT" index="1" function="A" pad="PB17"/>
              <signal group="EXTINT" index="2" function="A" pad="PA02"/>
              <signal group="EXTINT" index="2" function="A" pad="PA18"/>
              <signal group="EXTINT" index="2" function="A" pad="PB02"/>
              <signal group="EXTINT" index="3" function="A" pad="PA03"/>
              <signal group="EXTINT" index="3" function="A" pad="PA19"/>
              <signal group="EXTINT" index="3" function="A" pad="PB03"/>
              <signal group="EXTINT" index="4" function="A" pad="PA04"/>
              <signal group="EXTINT" index="4" function="A" pad="PA20"/>
              <signal group="EXTINT" index="4" function="A" pad="PB04"/>
              <signal group="EXTINT" index="5" function="A" pad="PA05"/>
              <signal group="EXTINT" index="5" function="A" pad="PA21"/>
              <signal group="EXTINT" index="5" function="A" pad="PB05"/>
              <signal group="EXTINT" index="6" function="A" pad="PA06"/>
              <signal group="EXTINT" index="6" function="A" pad="PA22"/>
              <signal group="EXTINT" index="6" function="A" pad="PB06"/>
              <signal group="EXTINT" index="6" function="A" pad="PB22"/>
              <signal group="EXTINT" index="7" function="A" pad="PA07"/>
              <signal group="EXTINT" index="7" function="A" pad="PA23"/>
              <signal group="EXTINT" index="7" function="A" pad="PB07"/>
              <signal group="EXTINT" index="7" function="A" pad="PB23"/>
              <signal group="EXTINT" index="8" function="A" pad="PA24"/>
              <signal group="EXTINT" index="8" function="A" pad="PB08"/>
              <signal group="EXTINT" index="9" function="A" pad="PA09"/>
              <signal group="EXTINT" index="9" function="A" pad="PA25"/>
              <signal group="EXTINT" index="9" function="A" pad="PB09"/>
              <signal group="EXTINT" index="10" function="A" pad="PA10"/>
              <signal group="EXTINT" index="10" function="A" pad="PB10"/>
              <signal group="EXTINT" index="11" function="A" pad="PA11"/>
              <signal group="EXTINT" index="11" function="A" pad="PA27"/>
              <signal group="EXTINT" index="11" function="A" pad="PB11"/>
              <signal group="EXTINT" index="12" function="A" pad="PA12"/>
              <signal group="EXTINT" index="12" function="A" pad="PB12"/>
              <signal group="EXTINT" index="13" function="A" pad="PA13"/>
              <signal group="EXTINT" index="13" function="A" pad="PB13"/>
              <signal group="EXTINT" index="14" function="A" pad="PA30"/>
              <signal group="EXTINT" index="14" function="A" pad="PB14"/>
              <signal group="EXTINT" index="14" function="A" pad="PB30"/>
              <signal group="EXTINT" index="14" function="A" pad="PA14"/>
              <signal group="EXTINT" index="15" function="A" pad="PA15"/>
              <signal group="EXTINT" index="15" function="A" pad="PA31"/>
              <signal group="EXTINT" index="15" function="A" pad="PB15"/>
              <signal group="EXTINT" index="15" function="A" pad="PB31"/>
              <signal group="NMI" function="A" pad="PA08"/>
            </signals>
            <parameters>
              <param name="EXTINT_NUM" value="16" caption="Number of external interrupts"/>
              <param name="GCLK_ID" value="4" caption="Generic Clock index"/>
              <param name="NUMBER_OF_CONFIG_REGS" value="2" caption="Number of CONFIG registers"/>
              <param name="NUMBER_OF_DPRESCALER_REGS" value="2" caption="Number of DPRESCALER pin groups"/>
              <param name="NUMBER_OF_INTERRUPTS" value="16" caption="Number of external interrupts (obsolete)"/>
              <param name="INSTANCE_ID" value="10" caption="Instance index for EIC"/>
            </parameters>
          </instance>
        </module>
        <module name="EVSYS" id="U2504" version="1.0.0">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x4100E000"/>
            <parameters>
              <param name="ASYNCHRONOUS_CHANNELS" value="0xFFFFF000" caption="Mask of Only Asynchronous Channels"/>
              <param name="CHANNELS" value="32" caption="Total Number of Channels"/>
              <param name="CHANNELS_BITS" value="5" caption="Number of bits to select Channel"/>
              <param name="EXTEVT_NUM" value="0" caption="Number of External Event Generators"/>
              <param name="GCLK_ID_0" value="11" caption="Index of Generic Clock 0"/>
              <param name="GCLK_ID_1" value="12" caption="Index of Generic Clock 1"/>
              <param name="GCLK_ID_2" value="13" caption="Index of Generic Clock 2"/>
              <param name="GCLK_ID_3" value="14" caption="Index of Generic Clock 3"/>
              <param name="GCLK_ID_4" value="15" caption="Index of Generic Clock 4"/>
              <param name="GCLK_ID_5" value="16" caption="Index of Generic Clock 5"/>
              <param name="GCLK_ID_6" value="17" caption="Index of Generic Clock 6"/>
              <param name="GCLK_ID_7" value="18" caption="Index of Generic Clock 7"/>
              <param name="GCLK_ID_8" value="19" caption="Index of Generic Clock 8"/>
              <param name="GCLK_ID_9" value="20" caption="Index of Generic Clock 9"/>
              <param name="GCLK_ID_10" value="21" caption="Index of Generic Clock 10"/>
              <param name="GCLK_ID_11" value="22" caption="Index of Generic Clock 11"/>
              <param name="GENERATORS" value="119" caption="Total Number of Event Generators"/>
              <param name="GENERATORS_BITS" value="7" caption="Number of bits to select Event Generator"/>
              <param name="SYNCH_NUM" value="12" caption="Number of Synchronous Channels"/>
              <param name="SYNCH_NUM_BITS" value="4" caption="Number of bits to select Synchronous Channels"/>
              <param name="USERS" value="67" caption="Total Number of Event Users"/>
              <param name="USERS_BITS" value="7" caption="Number of bits to select Event User"/>
              <param name="INSTANCE_ID" value="39" caption="Instance index for EVSYS"/>
            </parameters>
          </instance>
        </module>
