zephyrproject-rtos/hal_microchip/pic32c/pic32cx_sg/pic32cx_sg41/atdf/PIC32CX1025SG41064.atdf
    <module name="GMAC" id="U2005" version="1.0.0" caption="Ethernet MAC">
      <register-group name="SA" size="0x8">
        <register name="SAB" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Specific Address Bottom [31:0] Register">
          <bitfield name="ADDR" caption="Specific Address 1" mask="0xFFFFFFFF"/>
        </register>
        <register name="SAT" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Specific Address Top [47:32] Register">
          <bitfield name="ADDR" caption="Specific Address 1" mask="0xFFFF"/>
        </register>
      </register-group>
      <register-group name="GMAC" caption="Ethernet MAC">
        <register name="NCR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Network Control Register">
          <bitfield name="LBL" caption="Loop Back Local" mask="0x2"/>
          <bitfield name="RXEN" caption="Receive Enable" mask="0x4"/>
          <bitfield name="TXEN" caption="Transmit Enable" mask="0x8"/>
          <bitfield name="MPE" caption="Management Port Enable" mask="0x10"/>
          <bitfield name="CLRSTAT" caption="Clear Statistics Registers" mask="0x20"/>
          <bitfield name="INCSTAT" caption="Increment Statistics Registers" mask="0x40"/>
          <bitfield name="WESTAT" caption="Write Enable for Statistics Registers" mask="0x80"/>
          <bitfield name="BP" caption="Back pressure" mask="0x100"/>
          <bitfield name="TSTART" caption="Start Transmission" mask="0x200"/>
          <bitfield name="THALT" caption="Transmit Halt" mask="0x400"/>
          <bitfield name="TXPF" caption="Transmit Pause Frame" mask="0x800"/>
          <bitfield name="TXZQPF" caption="Transmit Zero Quantum Pause Frame" mask="0x1000"/>
          <bitfield name="SRTSM" caption="Store Receive Time Stamp to Memory" mask="0x8000"/>
          <bitfield name="ENPBPR" caption="Enable PFC Priority-based Pause Reception" mask="0x10000"/>
          <bitfield name="TXPBPF" caption="Transmit PFC Priority-based Pause Frame" mask="0x20000"/>
          <bitfield name="FNP" caption="Flush Next Packet" mask="0x40000"/>
          <bitfield name="LPI" caption="Low Power Idle Enable" mask="0x80000"/>
        </register>
        <register name="NCFGR" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00080000" caption="Network Configuration Register">
          <bitfield name="SPD" caption="Speed" mask="0x1"/>
          <bitfield name="FD" caption="Full Duplex" mask="0x2"/>
          <bitfield name="DNVLAN" caption="Discard Non-VLAN FRAMES" mask="0x4"/>
          <bitfield name="JFRAME" caption="Jumbo Frame Size" mask="0x8"/>
          <bitfield name="CAF" caption="Copy All Frames" mask="0x10"/>
          <bitfield name="NBC" caption="No Broadcast" mask="0x20"/>
          <bitfield name="MTIHEN" caption="Multicast Hash Enable" mask="0x40"/>
          <bitfield name="UNIHEN" caption="Unicast Hash Enable" mask="0x80"/>
          <bitfield name="MAXFS" caption="1536 Maximum Frame Size" mask="0x100"/>
          <bitfield name="RTY" caption="Retry Test" mask="0x1000"/>
          <bitfield name="PEN" caption="Pause Enable" mask="0x2000"/>
          <bitfield name="RXBUFO" caption="Receive Buffer Offset" mask="0xC000"/>
          <bitfield name="LFERD" caption="Length Field Error Frame Discard" mask="0x10000"/>
          <bitfield name="RFCS" caption="Remove FCS" mask="0x20000"/>
          <bitfield name="CLK" caption="MDC CLock Division" mask="0x1C0000" values="GMAC_NCFGR__CLK"/>
          <bitfield name="DBW" caption="Data Bus Width" mask="0x600000"/>
          <bitfield name="DCPF" caption="Disable Copy of Pause Frames" mask="0x800000"/>
          <bitfield name="RXCOEN" caption="Receive Checksum Offload Enable" mask="0x1000000"/>
          <bitfield name="EFRHD" caption="Enable Frames Received in Half Duplex" mask="0x2000000"/>
          <bitfield name="IRXFCS" caption="Ignore RX FCS" mask="0x4000000"/>
          <bitfield name="IPGSEN" caption="IP Stretch Enable" mask="0x10000000"/>
          <bitfield name="RXBP" caption="Receive Bad Preamble" mask="0x20000000"/>
          <bitfield name="IRXER" caption="Ignore IPG GRXER" mask="0x40000000"/>
        </register>
        <register name="NSR" offset="0x8" rw="R" size="4" access-size="4" initval="0x00000004" caption="Network Status Register">
          <bitfield name="MDIO" caption="MDIO Input Status" mask="0x2"/>
          <bitfield name="IDLE" caption="PHY Management Logic Idle" mask="0x4"/>
        </register>
        <register name="UR" offset="0xC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="User Register">
          <bitfield name="MII" caption="MII Mode" mask="0x1"/>
        </register>
        <register name="DCFGR" offset="0x10" rw="RW" size="4" access-size="4" initval="0x00020704" caption="DMA Configuration Register">
          <bitfield name="FBLDO" caption="Fixed Burst Length for DMA Data Operations:" mask="0x1F" values="GMAC_DCFGR__FBLDO"/>
          <bitfield name="ESMA" caption="Endian Swap Mode Enable for Management Descriptor Accesses" mask="0x40"/>
          <bitfield name="ESPA" caption="Endian Swap Mode Enable for Packet Data Accesses" mask="0x80"/>
          <bitfield name="RXBMS" caption="Receiver Packet Buffer Memory Size Select" mask="0x300" values="GMAC_DCFGR__RXBMS"/>
          <bitfield name="TXPBMS" caption="Transmitter Packet Buffer Memory Size Select" mask="0x400"/>
          <bitfield name="TXCOEN" caption="Transmitter Checksum Generation Offload Enable" mask="0x800"/>
          <bitfield name="DRBS" caption="DMA Receive Buffer Size" mask="0xFF0000"/>
          <bitfield name="DDRP" caption="DMA Discard Receive Packets" mask="0x1000000"/>
        </register>
        <register name="TSR" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Transmit Status Register">
          <bitfield name="UBR" caption="Used Bit Read" mask="0x1"/>
          <bitfield name="COL" caption="Collision Occurred" mask="0x2"/>
          <bitfield name="RLE" caption="Retry Limit Exceeded" mask="0x4"/>
          <bitfield name="TXGO" caption="Transmit Go" mask="0x8"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x10"/>
          <bitfield name="TXCOMP" caption="Transmit Complete" mask="0x20"/>
          <bitfield name="UND" caption="Transmit Underrun" mask="0x40"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x100"/>
        </register>
        <register name="RBQB" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Receive Buffer Queue Base Address">
          <bitfield name="ADDR" caption="Receive Buffer Queue Base Address" mask="0xFFFFFFFC"/>
        </register>
        <register name="TBQB" offset="0x1C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Transmit Buffer Queue Base Address">
          <bitfield name="ADDR" caption="Transmit Buffer Queue Base Address" mask="0xFFFFFFFC"/>
        </register>
