zephyrproject-rtos/hal_microchip/pic32c/pic32cx_sg/pic32cx_sg41/atdf/PIC32CX1025SG41064.atdf
      <value-group name="SDHC_HC2R__HS200EN">
        <value name="SDR12" caption="SDR12" value="0"/>
        <value name="SDR25" caption="SDR25" value="1"/>
        <value name="SDR50" caption="SDR50" value="2"/>
        <value name="SDR104" caption="SDR104" value="3"/>
        <value name="DDR50" caption="DDR50" value="4"/>
      </value-group>
      <value-group name="SDHC_CA0R__ADMA2SUP">
        <value name="NO" caption="ADMA2 not Supported" value="0"/>
        <value name="YES" caption="ADMA2 Supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA0R__ASINTSUP">
        <value name="NO" caption="Asynchronous Interrupt not Supported" value="0"/>
        <value name="YES" caption="Asynchronous Interrupt supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA0R__BASECLKF">
        <value name="OTHER" caption="Get information via another method" value="0"/>
      </value-group>
      <value-group name="SDHC_CA0R__ED8SUP">
        <value name="NO" caption="8-bit Bus Width not Supported" value="0"/>
        <value name="YES" caption="8-bit Bus Width Supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA0R__HSSUP">
        <value name="NO" caption="High Speed not Supported" value="0"/>
        <value name="YES" caption="High Speed Supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA0R__MAXBLKL">
        <value name="512" caption="512 bytes" value="0"/>
      </value-group>
      <value-group name="SDHC_CA0R__SB64SUP">
        <value name="NO" caption="32-bit Address Descriptors and System Bus" value="0"/>
        <value name="YES" caption="64-bit Address Descriptors and System Bus" value="1"/>
      </value-group>
      <value-group name="SDHC_CA0R__SDMASUP">
        <value name="NO" caption="SDMA not Supported" value="0"/>
        <value name="YES" caption="SDMA Supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA0R__SLTYPE">
        <value name="REMOVABLE" caption="Removable Card Slot" value="0"/>
        <value name="EMBEDDED" caption="Embedded Slot for One Device" value="1"/>
      </value-group>
      <value-group name="SDHC_CA0R__SRSUP">
        <value name="NO" caption="Suspend/Resume not Supported" value="0"/>
        <value name="YES" caption="Suspend/Resume Supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA0R__TEOCLKF">
        <value name="OTHER" caption="Get information via another method" value="0"/>
      </value-group>
      <value-group name="SDHC_CA0R__TEOCLKU">
        <value name="KHZ" caption="KHz" value="0"/>
        <value name="MHZ" caption="MHz" value="1"/>
      </value-group>
      <value-group name="SDHC_CA0R__V18VSUP">
        <value name="NO" caption="1.8V Not Supported" value="0"/>
        <value name="YES" caption="1.8V Supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA0R__V30VSUP">
        <value name="NO" caption="3.0V Not Supported" value="0"/>
        <value name="YES" caption="3.0V Supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA0R__V33VSUP">
        <value name="NO" caption="3.3V Not Supported" value="0"/>
        <value name="YES" caption="3.3V Supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA1R__CLKMULT">
        <value name="NO" caption="Clock Multiplier is Not Supported" value="0"/>
      </value-group>
      <value-group name="SDHC_CA1R__DDR50SUP">
        <value name="NO" caption="DDR50 is Not Supported" value="0"/>
        <value name="YES" caption="DDR50 is Supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA1R__DRVASUP">
        <value name="NO" caption="Driver Type A is Not Supported" value="0"/>
        <value name="YES" caption="Driver Type A is Supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA1R__DRVCSUP">
        <value name="NO" caption="Driver Type C is Not Supported" value="0"/>
        <value name="YES" caption="Driver Type C is Supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA1R__DRVDSUP">
        <value name="NO" caption="Driver Type D is Not Supported" value="0"/>
        <value name="YES" caption="Driver Type D is Supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA1R__SDR50SUP">
        <value name="NO" caption="SDR50 is Not Supported" value="0"/>
        <value name="YES" caption="SDR50 is Supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA1R__SDR104SUP">
        <value name="NO" caption="SDR104 is Not Supported" value="0"/>
        <value name="YES" caption="SDR104 is Supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA1R__TCNTRT">
        <value name="DISABLED" caption="Re-Tuning Timer disabled" value="0"/>
        <value name="1S" caption="1 second" value="1"/>
        <value name="2S" caption="2 seconds" value="2"/>
        <value name="4S" caption="4 seconds" value="3"/>
        <value name="8S" caption="8 seconds" value="4"/>
        <value name="16S" caption="16 seconds" value="5"/>
        <value name="32S" caption="32 seconds" value="6"/>
        <value name="64S" caption="64 seconds" value="7"/>
        <value name="128S" caption="128 seconds" value="8"/>
        <value name="256S" caption="256 seconds" value="9"/>
        <value name="512S" caption="512 seconds" value="10"/>
        <value name="1024S" caption="1024 seconds" value="11"/>
        <value name="OTHER" caption="Get information from other source" value="15"/>
      </value-group>
      <value-group name="SDHC_CA1R__TSDR50">
        <value name="NO" caption="SDR50 does not require tuning" value="0"/>
        <value name="YES" caption="SDR50 requires tuning" value="1"/>
      </value-group>
      <value-group name="SDHC_MCCAR__MAXCUR18V">
        <value name="OTHER" caption="Get information via another method" value="0"/>
        <value name="4MA" caption="4mA" value="1"/>
        <value name="8MA" caption="8mA" value="2"/>
        <value name="12MA" caption="12mA" value="3"/>
      </value-group>
